[
    {
        "title": "SA5 React + Routing",
        "date": "4/25/2019",
        "image": "./src/img/sa5.jpg",
        "description": {
            "short": "Declarative routing for React",
            "long": "What if you want your frontend to have routes — different URLs that map to different components and layouts of components? We’re going to add React Router to our starterpack so all your future projects can have it!"
        },
        "steps": [
            {
                "title": "Route Setup",
                "content": "Setup three different routes to display a Welcome, About, and Test components"
            },
            {
                "title": "URL Parameters",
                "content": "Lets add support for parameters in our urls so our component can get some more info about the url we're on "
            },
            {
                "title": "Unknown Routes",
                "content": "Create a Fallback component that will be displayed whenever we are taken to an unknwon route"
            },
            {
                "title": "Desployment",
                "content": "Deploy our new site using surge so it can be viewed by everyone and graded"
            }
        ],
        "link": "http://cs52.me/assignments/sa/routing/"
    },
    {
        "title": "Lab3 React Notes",
        "date": "4/22/2019",
        "image": "./src/img/lab3.png",
        "description": {
            "short": "Where we dive deeper into React and construct a realtime collaborative post-it note app with React!",
            "long": "We're going to be constructing a site that has a bunch of draggable notes. Each note has a title and some content. The title and content should be editable and everything should happen in real time."
        },
        "steps": [
            {
                "title": "Make a Note Component",
                "content": "Make a basic note component that has all the minimal functionaity. At this point, nothing will be persistent"
            },
            {
                "title": "Add Notes",
                "content": "Create an input that at minimum takes a title and creates a note on the page."
            },
            {
                "title": "Add Firebase",
                "content": "Set up a firebase database that will store your notes. Instead of changing state, now add and modify notes in the db to update in real time"
            }
        ],
        "link": "http://cs52.me/assignments/lab/react-notes/"     
    }
]